БухЭксп/Catalogs/CW_ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныУслуг</Name>
			<Comment>Шаблоны услуг для подстановки в документы клиентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнглийский</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор либо приложение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантПредставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыПредставленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаАктаОказанияУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПриложенияКДоговорам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.СогласованиеОбъктов
	CW_СогласованиеСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СогласованиеОбъктов
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	Элементы.Родитель.Видимость = ЗначениеЗаполнено(Объект.Родитель);
	РедактированиеЗапрещено_ШаблоныУслуг 	= РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено("РегистрСведений.CW_ШаблоныУслуг");
	
	СпособРедактированияНаименования		= ?(Объект.РедактироватьНаименование, 1, 0);
	Элементы.Наименование.ТолькоПросмотр 	= СпособРедактированияНаименования = 0;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВалютаДоговора		=  Объект.Договор.ВалютаДоговора;
		Объект.ВзаиморасчетыВУЕ 	=  Объект.Договор.ВзаиморасчетыВУЕ;
		Объект.БухгалтерскийУчет 	=  Объект.Договор.БухгалтерскийУчет;
	КонецЕсли;
	
	Контрагент	=  Объект.Договор.Владелец;
	Организация	=  Объект.Договор.Организация;
	ВидДоговора	=  Объект.Договор.ВидДоговора;
	
	УстановитьОтборДинамическихСписков();
	
	Элементы.ШаблоныУслуг.ТолькоПросмотр 				= РедактированиеЗапрещено_ШаблоныУслуг;
	Элементы.ШаблоныУслугКоманднаяПанель.Доступность 	= НЕ РедактированиеЗапрещено_ШаблоныУслуг;
	
	_УправлениеЭлементамиФормы();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	//Внешние подклчюаемые команды

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы();
	
	Оповестить("ЗаписьПриложенияДоговора", Объект.Договор);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Наличие прикрепленных файлов
	Если ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
		//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
		//Подсистема.СтатусыДокументов
		
		//Подсистема.СогласованиеОбъктов 
	ИначеЕсли ИмяСобытия = "Изменение_СогласованиеОбъектов" Тогда
		
		CW_СогласованиеКлиент.ОбновитьСтатусОбъекта(Истина, ЭтаФорма);
		//Подсистема.СогласованиеОбъктов
	КонецЕсли;
		
КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов

	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Объект.БухгалтерскийУчет Тогда
		Если Объект.УчетныйДоговор.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран учетный дооговор",,"УчетныйДоговор","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	CW_ДополнительныеХарактиристикиДоговоровСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	//ДокументыПоПриложению
	ДокументыПоПриложению.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = ДокументыПоПриложению.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ПриложениеКДоговору");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ДокументыПоПриложению.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("УказаноПриложение");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Истина;
	ЭлементОтбора.Использование 	= Истина;
	//ДокументыПоПриложению

	//ПараметрыДоговора
	ПараметрыДоговора.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = ПараметрыДоговора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбора.Использование = Истина;
	//ПараметрыДоговора
	
	
	//ШаблоныУслуг
	ШаблоныУслуг.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = ШаблоныУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Договор");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Договор;
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора = ШаблоныУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ПриложениеКДоговору");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.Использование 	= Истина;
	
	Если Объект.Договор.ВерсияДанных= ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		
		ЭлементОтбора = ШаблоныУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("РасходнаяСтатья");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина;
		ЭлементОтбора.Использование 	= Истина;
		
	Иначе
		ЭлементОтбора = ШаблоныУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДоходнаяСтатья");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина;
		ЭлементОтбора.Использование 	= Истина;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьНаименованиеПриИзменении(Элемент)
	
	Элементы.Наименование.ТолькоПросмотр = Ложь;
	
	Объект.РедактироватьНаименование 		= СпособРедактированияНаименования = 1;
	Элементы.Наименование.ТолькоПросмотр 	= СпособРедактированияНаименования = 0;
	
	Если НЕ Объект.РедактироватьНаименование Тогда
		
		// формируем стандартное наименование
		УстановитьПредставление();
		
	КонецЕсли; 

	
КонецПроцедуры


&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	УстановитьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаПриИзменении(Элемент)
	УстановитьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	
	УстановитьПредставление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьАвтоматическаяНумерацияПриложений()
	Возврат  ПолучитьФункциональнуюОпцию("CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями");
КонецФункции


&НаКлиенте 
Процедура УстановитьПредставление()
	
	Если СпособРедактированияНаименования = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента 	= ПолучитьКраткоеНаименование(Объект.ВидДокумента);
	Номер 			= ?(ЗначениеЗаполнено(Объект.НомерДокумента), " №" + СокрЛП(Объект.НомерДокумента), "");
	Дата 			= ?(ЗначениеЗаполнено(Объект.ДатаДокумента), " от "+ Формат(Объект.ДатаДокумента,"ДФ=dd.MM.yyyy"), "");
	
	ШаблонПредставления = "[ВидДокумента][Номер][Дата]";
	
	СтрПредставление = СтрЗаменить(ШаблонПредставления, "[ВидДокумента]", ВидДокумента);
	СтрПредставление = СтрЗаменить(СтрПредставление, "[Номер]", Номер);
	СтрПредставление = СтрЗаменить(СтрПредставление, "[Дата]", Дата);
	
	Объект.Наименование = СтрПредставление;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКраткоеНаименование(ВидДокумента)
	
	Возврат СокрЛП(ВидДокумента.КраткоеНаименование);
	
КонецФункции

//ШаблонДоговоров
&НаКлиенте
Процедура ЗаполнитьПараметрыПоШаблону(Команда)
	
	ОткрытьФормуВыбораВариантаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонДоговораПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ШаблонДоговора) Тогда
		
		ДанныеЗаполнения = новый Структура;
		
		//Подсистема.ДополнительныеХарактиристикиДоговоров
		CW_ДополнительныеХарактиристикиДоговоровСервер.ТребуетсяЗаполнениеДополнительныхХарактеристик(ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ЗаполнитьДополнительныеХарактеристики") Тогда
			ЗаполнитьДополнительныеХарактеристики = ДанныеЗаполнения.ЗаполнитьДополнительныеХарактеристики;
		КонецЕсли;
		//Подсистема.ДополнительныеХарактиристикиДоговоров
		
		Если ЗаполнитьДополнительныеХарактеристики и ДополнительныеХарактеристики.Количество() > 0 Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаСменыШаблона", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Заполнить свойства договора по шаблону?", Режим, 0);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСменыШаблона(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	ОткрытьФормуВыбораВариантаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВариантаЗаполнения()
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьВыборВариантаЗаполнения", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ВыборВариантаЗаполненияПараметровПоШаблону",,ЭтаФорма,,,,ОписаниеОпвещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВариантаЗаполнения(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	ОбработатьВыборВариантаЗаполеннияПараметровНаСервере(Ответ.ВариантПерезаполнить);
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
КонецПроцедуры
//ШаблонДоговоров


//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов


//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениедатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов


//Подсистема.ДополнительныеХарактиристикиДоговоров
&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрПриИзменении(Элемент)
	
	ОбработатьИзменениеПараметраНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПараметраНаСервере()
	
	CW_ДополнительныеХарактиристикиДоговоровСервер.ДополнительныеХарактеристикиПараметрПриИзменении(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПриИзменении(Элемент)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ДополнительныеХарактеристикиПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПараметрНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные.ОграниченСпискомЗначений Тогда
		ДанныеВыбора = ПолучитьСписокВыбораНаСервере();
		СтандартнаяОбработка = ДанныеВыбора = Неопределено;
	Конецесли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()
	
	мДоступныеЗначения = CW_ДополнительныеХарактиристикиДоговоровСервер.ПолучитьСписокВыбораПараметра(ЭтаФорма);
	Если мДоступныеЗначения <> Неопределено Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(мДоступныеЗначения);
		
		Возврат СписокВыбора;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбработатьВыборВариантаЗаполеннияпараметровНаСервере(Результат)
	
	CW_ДополнительныеХарактиристикиДоговоровСервер.ЗаполнитьСписокПараметровПоШаблону(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПередНачаломДобавления(Отказ, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)  
	Если НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеХарактеристикиПриНачалеРедактированияНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ДополнительныеХарактеристикиПриНачалеРедактированияНаСервере()
	CW_ДополнительныеХарактиристикиДоговоровСервер.УстановитьСвязиПараметровВыбора(ЭтаФорма);
КонецПроцедуры


//Подсистема.ДополнительныеХарактиристикиДоговоров


//Подсистема.ГруппыУслугПриложенийИДоговоров
&НаКлиенте
Процедура ИспользуетсяОграниченияПоГруппамУслугПриИзменении(Элемент)
	CW_ГруппыУслугКлиент.ИспользуетсяОграниченияПоГруппамУслугПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУслугПередУдалением(Элемент, Отказ)
	
	CW_ГруппыУслугКлиент.ПередУдалениемГруппыУслуг(ЭтаФорма,Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	CW_ГруппыУслугКлиент.ПередНачаломДобавленияГруппыУслуг(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры
//Подсистема.ГруппыУслугПриложенийИДоговоров


//Подсистема.НумерацияДоговоровИПриложений
&НаКлиенте
Процедура УстановитьНовыйНомер(Команда)
	
	CW_НумерацияДоговоровИПриложенийКлиент.ОбновитьНомерОбъкта(ЭтаФорма, "CW_ПриложенияКДоговорам", "НомерДокумента");
	
КонецПроцедуры
//Подсистема.НумерацияДоговоровИПриложений


&НаКлиенте
Процедура СоздатьУчетныйДоговор(Команда)
	
	
	Если НЕ Объект.УчетныйДоговор.Пустая() Тогда
		ПоказатьПредупреждение(, "Учетный договор уже создан!",30,"Создание учетного договора");
		Возврат;
	КонецЕсли; 
	
	// проверяем заполненные поля
	Отказ = Ложь;
	Если Объект.Договор.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отсутствует основной договор!",,"ОбъектВладелец", "ЭтотОбъект", Отказ);
	КонецЕсли; 
	Если ПустаяСтрока(Объект.НомерДокумента)Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана номер приложения",,"НомерДокумента", "ЭтотОбъект", Отказ);
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ДатаДокумента)Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана дата приложения",,"ДатаДокумента", "ЭтотОбъект", Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		СоздатьУчетныйДоговорНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьУчетныйДоговорНаСервере()
	
	УчетныйДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Владелец КАК Владелец,
	               |	CW_ДоговорыПоГрузоперевозкам.Организация КАК Организация,
	               |	CW_ДоговорыПоГрузоперевозкам.ВидДоговора КАК ВидДоговора
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОсновнойДоговор = РезультатЗапроса.Выбрать();
	ВыборкаОсновнойДоговор.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.Номер = &Номер
	               |	И ДоговорыКонтрагентов.Дата = &Дата
	               |	И ДоговорыКонтрагентов.Владелец = &Владелец
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	               |	И ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах = &РасчетыВУсловныхЕдиницах";
	
	Запрос.УстановитьПараметр("Номер",	Объект.НомерДокумента);
	Запрос.УстановитьПараметр("Дата",	Объект.ДатаДокумента);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", 		Объект.ВалютаДоговора);
	Запрос.УстановитьПараметр("РасчетыВУсловныхЕдиницах",	Объект.ВзаиморасчетыВУЕ);
	
	Запрос.УстановитьПараметр("Организация", 	ВыборкаОсновнойДоговор.Организация);
	Запрос.УстановитьПараметр("Владелец",		ВыборкаОсновнойДоговор.Владелец);
	Запрос.УстановитьПараметр("ВидДоговора",	ВыборкаОсновнойДоговор.ВидДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		УчетныйДоговор = Выборка.Ссылка; 	
	КонецЕсли;
	
	Если УчетныйДоговор.Пустая() Тогда
		
		Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Договор.Наименование 	= Объект.Наименование+" ("+Объект.Договор.Наименование+")";
		Договор.Владелец 		= ВыборкаОсновнойДоговор.Владелец;
		Договор.Организация 	= ВыборкаОсновнойДоговор.Организация;
		Договор.ВидДоговора 	= ВыборкаОсновнойДоговор.ВидДоговора;
		
		Договор.Номер	= Объект.НомерДокумента;
		Договор.Дата	= Объект.ДатаДокумента;
		Договор.ВалютаВзаиморасчетов 	 = Объект.ВалютаДоговора;
		Договор.РасчетыВУсловныхЕдиницах = Объект.ВзаиморасчетыВУЕ;
		
		Договор.СпособЗаполненияСтавкиНДС 	= ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.Автоматически");
		Договор.СпособВыставленияДокументов = ПредопределенноеЗначение("Перечисление.СпособыВыставленияДокументов.Автоматически");
		
		Договор.Записать();
		
		УчетныйДоговор = Договор.Ссылка;	
		
		ТекущийУчетныйДоговор = Договор.Ссылка;
		
	КонецЕсли; 
	
	Объект.УчетныйДоговор = УчетныйДоговор;	
	ТекущийУчетныйДоговор = УчетныйДоговор;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСлужебныеДоговораНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АгентскийДоговорНаЗакупку", Объект.АгентскийДоговорНаЗакупку);
	СтруктураПараметров.Вставить("АгентскийДоговорНаПродажу", Объект.АгентскийДоговорНаПродажу);
	СтруктураПараметров.Вставить("ДоговорДляВыявленияФинансовогоРезультата", Объект.ДоговорДляВыявленияФинансовогоРезультата);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьИзменениеСлужебныхДоговоров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_СлужебныеДоговора", СтруктураПараметров, ЭтаФорма,,,, ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСлужебныхДоговоров(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.АгентскийДоговорНаЗакупку <>  Результат.АгентскийДоговорНаЗакупку Тогда
		Объект.АгентскийДоговорНаЗакупку = Результат.АгентскийДоговорНаЗакупку;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.АгентскийДоговорНаПродажу <>  Результат.АгентскийДоговорНаПродажу Тогда
		Объект.АгентскийДоговорНаПродажу = Результат.АгентскийДоговорНаПродажу;
		Модифицированность = Истина;
	КонецЕсли;
	Если Объект.ДоговорДляВыявленияФинансовогоРезультата <>  Результат.ДоговорДляВыявленияФинансовогоРезультата Тогда
		Объект.ДоговорДляВыявленияФинансовогоРезультата = Результат.ДоговорДляВыявленияФинансовогоРезультата;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БухгалтерскийУчетПриИзменении(Элемент)
	
	// при наличии проведенных документов по договору изменять признак не даем
	Если Не Объект.БухгалтерскийУчет Тогда
		Если ЕстьПроведенныеДокументыПоДоговору() Тогда 
			Объект.БухгалтерскийУчет = НЕ Объект.БухгалтерскийУчет;
			ПоказатьПредупреждение(	, "По приложению есть проведённые документы. 
			|Изменять признак ведения бухгалтерского учёта запрещено!"	);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	_БухгалтерскийУчетПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция _БухгалтерскийУчетПриИзменении()
	
	Если (НЕ Объект.БухгалтерскийУчет) Тогда
		//Объект.УчетныйДоговор = Неопределено;
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
КонецФункции


&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.ГруппаУчетныйДоговор.Видимость	= Объект.БухгалтерскийУчет;
	
КонецПроцедуры


&НаСервере
Функция ЕстьПроведенныеДокументыПоДоговору()
	
	ЕстьДокументы = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_ДокументыПоДоговорамИПриложениям.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.CW_ДокументыПоДоговорамИПриложениям(&Договор) КАК CW_ДокументыПоДоговорамИПриложениям
		|ГДЕ
		|	CW_ДокументыПоДоговорамИПриложениям.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Договор", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ЕстьДокументы = НЕ РезультатЗапроса.Пустой();	
		
	КонецЕсли;
	
	Возврат ЕстьДокументы;
	
КонецФункции


&НаКлиенте
Процедура ЗаполнитьГрупппыУслугИзПриложения(Команда)
	
	Если Объект.Ссылка.Пустая() тогда
		ПоказатьПредупреждение(,"Необходимо записать приложение!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаКопированияГруппУслуг", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Группы услуг будут скопированы из выбранного приложения. Продолжить?", Режим, 0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаКопированияГруппУслуг(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПродолжитьКопированиеГруппУслуг",ЭтотОбъект);
	
	ПараметрыФормыВыбора = новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("МножественыйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.CW_ПриложенияКДоговорам.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКопированиеГруппУслуг(ВыбранноеЗначение, Параметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьКопированиеГруппУслугВФоне(ВыбранноеЗначение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатКопированияГруппУслуг", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьКопированиеГруппУслугВФоне(ЗначениеКопирования)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Копирование групп услуг приложения к договору";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТекущийОбъект", 		Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("ЗначениеКопирования", 	ЗначениеКопирования);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.CW_ХарактеристикиГруппУслуг.СкопироватьДатыОказанияГруппУслуг",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатКопированияГруппУслуг(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Элементы.ГруппыУслуг.Обновить();
		ПоказатьОповещениеПользователя("Группы услуг заполнены");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Группы услуг не скопированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка копирования групп услуг");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВеденияБухгалтерскогоУчетаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииДатыБухгалтескогоУчета", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Документы до даты начала ведения бухгалтерского учета не будут формировать связанных документов бухгалтерского учета. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииДатыБухгалтескогоУчета(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Подсказка = "Введите дату";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыДатыБухгалтескогоУчета", ЭтотОбъект, Параметры);
	ПоказатьВводДаты(Оповещение, ТекущаяДата(), Подсказка, ЧастьДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыДатыБухгалтескогоУчета(НоваяДата, Параметры) Экспорт
	
	Если НоваяДата = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.ДатаНачалаВеденияБухгалтерскогоУчета = НоваяДата;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияДоговораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Договор", Объект.Договор);
	ЗначенияЗаполнения.Вставить("Родитель", Объект.Ссылка);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.CW_ПриложенияКДоговорам.ФормаОбъекта", СтруктураПараметров,ЭтаФорма);
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти
